/* 2353726 信01 付煜超 */

/* ----具体要求----
   1、允许添加需要的头文件
   2、不允许定义全局变量、静态局部变量
   3、不允许添加其它函数
   ---------------------------------------------------------------------
*/
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <math.h>
/***************************************************************************
  函数名称：
  功    能：求平方根的函数，返回为a的平方根
  输入参数：
  返 回 值：
  说    明：
 ***************************************************************************/
double my_sqrt(double a)
{
	double x1, x2, x3;
	x1 = a / 2;
	x2 = (x1 + a / x1) / 2;
	while (fabs(x1-x2)>1e-5)
	{
		x3 = x2;
		x2 = (x2 + a / x2) / 2;
		x1 = x3;
	}
	return x2;
}

/***************************************************************************
  函数名称：
  功    能：重复输入，直到取得double型非负数后返回
  输入参数：
  返 回 值：
  说    明：不准修改函数名、返回类型、形参
 ***************************************************************************/
double input()
{
	double a;
	while (1)
	{
		printf("请输入a值\n");
		int ret = scanf("%lf", &a);
		if (ret == 1 && a >= 0)
			break;
		if (ret == 0)
		{
			char ch;
			while ((ch = getchar()) != '\n' && ch != EOF);
			continue;
		}
		else
		{
			continue;
		}
	}
	return a;
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：只允许修改...部分
 ***************************************************************************/
int main()
{
	/* 键盘输入要求平方根的数 */
	double a = input();
	/* 调用求平方根的函数 */
	double d = my_sqrt(a);

	/* 此处输出平方根（语句不全，将后面补齐）*/
	printf("%0.3lf的平方根=%0.5lf", a, d);

	return 0;
}